AUTO_config_TK_pesok/src/DataProcessors/ТК_ПечатьЭтикетокИЦенников/ТК_ПечатьЭтикетокИЦенников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ТК_ПечатьЭтикетокИЦенников</name>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Выбран</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Артикул</name>
      <comment>Код производителя</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <comment>Номенклатура (товар, услуга и т.п.)</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Наименование2</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <comment>Характеристика/серия номенклатуры</comment>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <comment>Цена номенклатурной позиции</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>Количество ценников</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихКод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СкладКомпании</name>
      <type>
        <types>CatalogRef.СкладыКомпании</types>
      </type>
    </attributes>
    <attributes>
      <name>СтараяЦена</name>
      <comment>Цена номенклатурной позиции</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачалоДействия</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонецДействия</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Акция</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаОПТ</name>
      <comment>Цена номенклатурной позиции</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

AUTO_config_TK_pesok/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Артикул</name>
    <comment>Код производителя</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>Полное наименование, например, для печати</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Наименование2</name>
    <comment>Локализованное наименование 2</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БазоваяЕдиницаИзмерения</name>
    <comment>Базовая единица измерения номенклатуры</comment>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяЕдиницаИзмерения</name>
    <comment>Основная единица измерения номенклатуры</comment>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияУпаковки</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияЯщиков</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипНоменклатуры</name>
    <comment>Тип номенклатуры</comment>
    <type>
      <types>CatalogRef.ТипыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <comment>Вид номенклатуры</comment>
    <type>
      <types>EnumRef.ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварнаяМарка</name>
    <type>
      <types>CatalogRef.ТоварныеМарки</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <comment>Ставка НДС по умолчанию для оформления документов</comment>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаПроисхождения</name>
    <comment>Страна происхождения по умолчанию</comment>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокХраненияТовара</name>
    <comment>Срок хранения товара (в днях)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ширина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Высота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Глубина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаЦенообразования</name>
    <comment>Группа ценообразования</comment>
    <type>
      <types>CatalogRef.ГруппыЦенообразования</types>
    </type>
  </attributes>
  <attributes>
    <name>КодУКТВЭД</name>
    <type>
      <types>CatalogRef.КлассификаторУКТВЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>АкцизГруппа</name>
    <comment>Группа акциза</comment>
    <type>
      <types>CatalogRef.ГруппыАкциза</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаДляБухгалтерии</name>
    <comment>Группа для бухгалтерии</comment>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипНоменклатурыПланирования</name>
    <type>
      <types>CatalogRef.ТипНоменклатурыПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользованиеХарактеристик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьПФ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойШтрихКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойАртикул</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипИндикатива</name>
    <type>
      <types>CatalogRef.ТК_ТипыИндикатива</types>
    </type>
  </attributes>
  <attributes>
    <name>Крепость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеRB</name>
    <comment>Наименование  для Radio Beacon</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоэффициентВыгрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.ТК_Производитель</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодакцизныйТовар</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеАктивный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИД_Товара</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СоставНабора</name>
    <comment>Состав набора</comment>
    <attributes>
      <name>Номенклатура</name>
      <comment>Номенклатура</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>Количество</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <comment>Характеристика номенклатуры</comment>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособРасчетаЦены</name>
      <comment>Способ расчета цены реализации</comment>
      <type>
        <types>EnumRef.СпособыРасчетаЦены</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

AUTO_config_TK_pesok/src/DataProcessors/ТК_ПечатьЭтикетокИЦенников/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокНоменклатуры = Новый СписокЗначений;
	
	Если Параметры.Свойство("МассивОбьектов") И ЗначениеЗаполнено(Параметры.МассивОбьектов) Тогда
		Если ТипЗнч(Параметры.МассивОбьектов[0].Ссылка) = Тип("ДокументСсылка.ТК_НазначениеСкидок") Тогда 
			Для Каждого СтрДок Из Параметры.МассивОбьектов Цикл
				Для Каждого СтрТовары Из СтрДок.Скидки Цикл 
					СписокНоменклатуры.Добавить(СтрТовары.Номенклатура);
				КонецЦикла;
			КонецЦикла;
		Иначе
			Для Каждого СтрДок Из Параметры.МассивОбьектов Цикл
				Для Каждого СтрТовары Из СтрДок.Товары Цикл 
					НоваяСтрока = Объект.Товары.Добавить();
					НоваяСтрока.Номенклатура = СтрТовары.Номенклатура;
					НоваяСтрока.Наименование2 = СтрТовары.Номенклатура.Наименование2;
					НоваяСтрока.Артикул = СтрТовары.Номенклатура.Артикул;
					НоваяСтрока.ХарактеристикаНоменклатуры = СтрТовары.ХарактеристикаНоменклатуры;
					НоваяСтрока.ШтрихКод = СтрТовары.Номенклатура.ОсновнойШтрихКод;
					НоваяСтрока.Цена = СтрТовары.НоваяЦена;
					НоваяСтрока.Количество = 1;                   
					НоваяСтрока.Выбран = Истина;
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	//Шаблоны ценников
	СписокВыбораШаблонов = Элементы.ШаблонДляПечати.СписокВыбора;
	СписокВыбораШаблонов.Добавить("ПФ_MXL_МакетЦенника", НСтр("ru = 'Ценник 60х38 + QR'; uk = 'Цінник 60х38 + QR'"));
	СписокВыбораШаблонов.Добавить("ПФ_MXL_МакетЦенника50х38", НСтр("ru = 'Ценник 50х38 + QR'; uk = 'Цінник 50х38 + QR'"));
	СписокВыбораШаблонов.Добавить("ПФ_MXL_МакетЦенникаАкция", НСтр("ru = 'Ценник 60х38 + QR Акция'; uk = 'Цінник 60х38 + QR Акция'"));
	СписокВыбораШаблонов.Добавить("ПФ_MXL_МакетЦенникаЗа50грАттика", НСтр("ru = 'Ценник 60х38 за 50 гр'; uk = 'Цінник 60х38 за 50 гр'"));
	СписокВыбораШаблонов.Добавить("ПФ_MXL_МакетЦенникаЗа100гр", НСтр("ru = 'Ценник 60х38 + QR за 100 гр'; uk = 'Цінник 60х38 + QR за 100гр'"));
	СписокВыбораШаблонов.Добавить("ПФ_MXL_МакетЦенникаСклад", НСтр("ru = 'Ценник 60х38ШК + Склад'; uk = 'Цінник 60х38ШК + Склад'"));
	СписокВыбораШаблонов.Добавить("ПФ_MXL_МакетЦенникаАттика", НСтр("ru = 'Ценник Аттика'; uk = 'Цінник Аттіка'"));
	СписокВыбораШаблонов.Добавить("ПФ_MXL_МакетЦенникаДемента", НСтр("ru = 'Ценник Демента'; uk = 'Цінник Демента'"));
	СписокВыбораШаблонов.Добавить("ПФ_MXL_МакетЦенника35х30", НСтр("ru = 'Ценник 35х30'; uk = 'Цінник 35х30'"));
	СписокВыбораШаблонов.Добавить("ПФ_MXL_МакетЦенника40х30", НСтр("ru = 'Ценник 40х30'; uk = 'Цінник 40х30'"));
	СписокВыбораШаблонов.Добавить("ПФ_MXL_МакетЦенника25х46", НСтр("ru = 'Ценник 25х46'; uk = 'Цінник 25х46'"));
	СписокВыбораШаблонов.Добавить("ПФ_MXL_МакетЦенникаБаффет60х38", НСтр("ru = 'Ценник 60х38 + QR Баффет'; uk = 'Цінник 60х38 + QR Баффет'"));
	СписокВыбораШаблонов.Добавить("ПФ_MXL_МакетЦенникаАкция96*76ТТ", НСтр("ru = 'Ценник Товар недели 96*76 + QR Баффет'; uk = 'Цінник Товар тижня 96*76 + QR Баффет'"));
	СписокВыбораШаблонов.Добавить("ПФ_MXL_МакетЦенникаАкция96*76Р", НСтр("ru = 'Ценник Распродажа 96*76 + QR Баффет'; uk = 'Цінник Розпродаж 96*76 + QR Баффет'"));
	СписокВыбораШаблонов.Добавить("ПФ_MXL_МакетЦенникаАкция96*76РМ", НСтр("ru = 'Ценник Распродажа МРЦ 96*76 + QR Баффет'; uk = 'Цінник Розпродаж МРЦ 96*76 + QR Баффет'"));
	СписокВыбораШаблонов.Добавить("ПФ_MXL_МакетЦенникаАкция96*76ПЦ", НСтр("ru = 'Ценник Первая цена 96*76 + QR Баффет'; uk = 'Цінник Перша ціна 96*76 + QR Баффет'"));
	СписокВыбораШаблонов.Добавить("ПФ_MXL_МакетЦенникаАкция96*76А", НСтр("ru = 'Ценник Акция 96*76 + QR Баффет'; uk = 'Цінник Акція 96*76 + QR Баффет'"));
	СписокВыбораШаблонов.Добавить("ПФ_MXL_МакетЦенникаАкция96*76КБПМ", НСтр("ru = 'Ценник Покупай больше 96*76 + QR Баффет'; uk = 'Цінник Купуй більше 96*76 + QR Баффет'"));
	СписокВыбораШаблонов.Добавить("ПФ_MXL_МакетЦенникаАкция96*76ШЦ", НСтр("ru = 'Ценник Шок цена 96*76 + QR Баффет'; uk = 'Цінник Шок ціна 96*76 + QR Баффет'"));
	СписокВыбораШаблонов.Добавить("ПФ_MXL_МакетЦенникаАкция60*38Аттика", НСтр("ru = 'Ценник Акция 60*38 Аттика'; uk = 'Цінник Акція 60*38 Аттіка'"));

	//Заполняем реквизиты формы	
	Дата = ТекущаяДата();
	СкладКомпании = ЗначениеНастроекПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователи.ТекущийПользователь(), "ОсновнойСклад",, СкладКомпании);	
	ШаблонДляПечати = СписокВыбораШаблонов.Получить(0);
	
	//ОбработкаОбъект = РеквизитФормыВЗначение("Объект");	
	//СхемаКомпоновкиДанных = ОбработкаОбъект.ПолучитьМакет("ПоляШаблонаТовары");
  	Обработка =  РеквизитФормыВЗначение("Объект");
	СхемаКомпоновкиДанных = Обработка.ПолучитьМакет("ПоляШаблонаТовары");

	//СхемаКомпоновкиДанных = Обработки.ТК_ПечатьЭтикетокИЦенников.ПолучитьМакет("ПоляШаблонаТовары");
	
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, ЭтаФорма.УникальныйИдентификатор)));	
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);			

	Если СписокНоменклатуры.Количество()>0 Тогда
		УстановитьОтборСКД("ОтборНоменклатура", ВидСравненияКомпоновкиДанных.ВСписке, СписокНоменклатуры);			
	КонецЕсли;

КонецПроцедуры


#КонецОбласти


#Область ОбработчикиСобытийЭлементовФормы


#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьТоварыПоОтборам(Команда)
		
	ЗаполнитьТоварыПоОтборамНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТоварыПоОтборамНаСервере()
	
	ТребуемыеОтборы = Новый Массив;
	ТребуемыеОтборы.Добавить(Новый ПолеКомпоновкиДанных("ОтборНоменклатура"));
	ТребуемыеОтборы.Добавить(Новый ПолеКомпоновкиДанных("ОтборСклад"));
	ТребуемыеОтборы.Добавить(Новый ПолеКомпоновкиДанных("КоличествоОстаток"));

	ВсеОк = 0;
	
	Для Каждого Отбор Из КомпоновщикНастроек.ПолучитьНастройки().Отбор.Элементы Цикл
		Если ТребуемыеОтборы.Найти(Отбор.ЛевоеЗначение) <> Неопределено и Отбор.Использование = Истина Тогда
			ВсеОк = ВсеОк+1;	
		КонецЕсли;
	КонецЦикла;
	
	Если ВсеОк < 2 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнены основные отборы Номенклатура и Склад!");
		Возврат;
	КонецЕсли;
	
	Объект.Товары.Очистить();
	
	УстановитьПривилегированныйРежим(Истина);
	
	//Обработка =  РеквизитФормыВЗначение("Объект");
	//СхемаКомпоновкиДанных = Обработка.ПолучитьМакет("ПоляШаблонаТовары");

	СхемаКомпоновкиДанных = Обработки.ТК_ПечатьЭтикетокИЦенников.ПолучитьМакет("ПоляШаблонаТовары");
		
	ТаблицаРезультат = Новый ТаблицаЗначений;
	
	НаДату = КонецДня(Дата);
	
	ПараметрыСКД = Новый Структура;
	ПараметрыСКД.Вставить("НаДату", НаДату);
	ПараметрыСКД.Вставить("ТипЦенОПТ", Справочники.ТипыЦен.НайтиПоКоду("GL000035"));
	//ПараметрыСКД.Вставить("ВедетсяУчетХарактеристикНаСкладе", Не Справочники.СкладыКомпании.НеВестиУчетПоХарактеристикамНаСкладе(СкладКомпании, НаДату));
	
	НастройкиКомпоновщика = КомпоновщикНастроек.Настройки; 
	ПараметрыНастройки = НастройкиКомпоновщика.ПараметрыДанных; 

	Для Каждого знПараметр Из ПараметрыСКД Цикл 
		нПараметр = НастройкиКомпоновщика.ПараметрыДанных.Элементы.Найти(знПараметр.Ключ);
		Если нПараметр <> Неопределено Тогда 
			нПараметр.Использование = Истина;
			нПараметр.Значение = знПараметр.Значение;			
		КонецЕсли;
	КонецЦикла;	
	
	//Получим макет компоновки    
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных; 
	МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиКомпоновщика,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений")); 
	
	//Через процессор компоновки получим результат
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных; 
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных); 
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;	
	
	ПроцессорВывода.УстановитьОбъект(ТаблицаРезультат); 
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных); 
	
	ТаблицаРезультат.Колонки.Добавить("Количество");
	ТаблицаРезультат.Колонки.Добавить("Выбран");
	
	ТаблицаРезультат.ЗаполнитьЗначения(1, "Количество");
	ТаблицаРезультат.ЗаполнитьЗначения(Истина, "Выбран");
	
	Объект.Товары.Загрузить(ТаблицаРезультат);
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьФлажки(Команда)
	ЗаполнитьЗначенияФлажков(Истина);
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	ЗаполнитьЗначенияФлажков(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
		
	Если Не ЭтаФорма.ПроверитьЗаполнение() Тогда 
		Возврат;
	КонецЕсли;
	
	ТаблДок = СформироватьТабличныйДокумент();
	
	Если ТаблДок = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("ЦенникиРозница");
	ТекКоллекция = КоллекцияПечатныхФорм[0];
	ТекКоллекция.ТабличныйДокумент = ТаблДок;
	ТекКоллекция.Экземпляров = 1;
	ТекКоллекция.СинонимМакета = ШаблонДляПечати;
	
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, Неопределено, ЭтаФорма);
	
	
КонецПроцедуры


#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗаполнитьЗначенияФлажков(Значение)
	
	Для Каждого СтрТовары Из Объект.Товары Цикл 
		СтрТовары.Выбран = Значение;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция СформироватьТабличныйДокумент()
	
	Если ШаблонДляПечати = "ПФ_MXL_МакетЦенника" Тогда 
		Возврат СформироватьЦенник60х38QR();
	ИначеЕсли ШаблонДляПечати = "ПФ_MXL_МакетЦенникаАкция" Тогда 
		Возврат СформироватьЦенник60х38QRАкция();
	ИначеЕсли ШаблонДляПечати = "ПФ_MXL_МакетЦенникаЗа100гр" Тогда 
		Возврат СформироватьЦенник60х38QRЗа100();
	ИначеЕсли ШаблонДляПечати = "ПФ_MXL_МакетЦенникаСклад" Тогда 
		Возврат СформироватьЦенник60х38Склад();
	ИначеЕсли ШаблонДляПечати = "ПФ_MXL_МакетЦенникаАттика" Тогда 
		Возврат СформироватьЦенникАттика();
	ИначеЕсли ШаблонДляПечати = "ПФ_MXL_МакетЦенникаДемента" Тогда 
		Возврат СформироватьЦенникДемента();
	ИначеЕсли ШаблонДляПечати = "ПФ_MXL_МакетЦенника35х30" Тогда 
		Возврат СформироватьЦенник35х30();
	ИначеЕсли ШаблонДляПечати = "ПФ_MXL_МакетЦенника40х30" Тогда 
		Возврат СформироватьЦенник40х30();
	ИначеЕсли ШаблонДляПечати = "ПФ_MXL_МакетЦенника25х46" Тогда 
		Возврат СформироватьЦенник25х46();
	ИначеЕсли ШаблонДляПечати = "ПФ_MXL_МакетЦенникаБаффет60х38" Тогда 
		Возврат СформироватьЦенник60х38QRБаффет();
	ИначеЕсли ШаблонДляПечати = "ПФ_MXL_МакетЦенника50х38" Тогда 
		Возврат СформироватьЦенник50х38QR();
	ИначеЕсли ШаблонДляПечати = "ПФ_MXL_МакетЦенникаЗа50грАттика" Тогда 
		Возврат СформироватьЦенник60х38За50гр();
	ИначеЕсли ШаблонДляПечати = "ПФ_MXL_МакетЦенникаАкция96*76ТТ" Тогда 
		Возврат СформироватьЦенник120х76QRАкция(ШаблонДляПечати);
	ИначеЕсли ШаблонДляПечати = "ПФ_MXL_МакетЦенникаАкция96*76Р" Тогда 
		Возврат СформироватьЦенник120х76QRАкция(ШаблонДляПечати);
	ИначеЕсли ШаблонДляПечати = "ПФ_MXL_МакетЦенникаАкция96*76РМ" Тогда 
		Возврат СформироватьЦенник120х76QRАкция(ШаблонДляПечати);
	ИначеЕсли ШаблонДляПечати = "ПФ_MXL_МакетЦенникаАкция96*76ПЦ" Тогда 
		Возврат СформироватьЦенник120х76QRАкция(ШаблонДляПечати);
	ИначеЕсли ШаблонДляПечати = "ПФ_MXL_МакетЦенникаАкция96*76А" Тогда 
		Возврат СформироватьЦенник120х76QRАкция(ШаблонДляПечати);
	ИначеЕсли ШаблонДляПечати = "ПФ_MXL_МакетЦенникаАкция96*76КБПМ" Тогда 
		Возврат СформироватьЦенник120х76QRАкция(ШаблонДляПечати);
	ИначеЕсли ШаблонДляПечати = "ПФ_MXL_МакетЦенникаАкция96*76ШЦ" Тогда 
		Возврат СформироватьЦенник120х76QRАкция(ШаблонДляПечати);
	ИначеЕсли ШаблонДляПечати = "ПФ_MXL_МакетЦенникаАкция60*38Аттика" Тогда 
		Возврат СформироватьЦенник60х38АкцияАттика();
	Иначе 
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция СформироватьЦенник60х38QR()
		Возврат  Обработки.ТК_ПечатьЭтикетокИЦенников.СформироватьЦенник60х38QR(Объект.Товары);
КонецФункции

&НаСервере
Функция СформироватьЦенник60х38QRАкция()
		Возврат  Обработки.ТК_ПечатьЭтикетокИЦенников.СформироватьЦенник60х38QRАкция(Объект.Товары);
КонецФункции

&НаСервере
Функция СформироватьЦенник120х76QRАкция(ШаблонДляПечати)
		Возврат  Обработки.ТК_ПечатьЭтикетокИЦенников.СформироватьЦенник120х76QRАкция(Объект.Товары, ШаблонДляПечати);
КонецФункции

&НаСервере
Функция СформироватьЦенник60х38АкцияАттика()
		Возврат  Обработки.ТК_ПечатьЭтикетокИЦенников.СформироватьЦенник60х38АкцияАттика(Объект.Товары);
КонецФункции

&НаСервере
Функция СформироватьЦенник60х38За50гр()
		Возврат  Обработки.ТК_ПечатьЭтикетокИЦенников.СформироватьЦенник60х38за50гр(Объект.Товары);
КонецФункции

&НаСервере
Функция СформироватьЦенник60х38QRЗа100()
		Возврат  Обработки.ТК_ПечатьЭтикетокИЦенников.СформироватьЦенник60х38QRза100гр(Объект.Товары);
КонецФункции

&НаСервере
Функция СформироватьЦенник60х38Склад()

	Возврат  Обработки.ТК_ПечатьЭтикетокИЦенников.СформироватьЦенник60х38Склад(Объект.Товары);
КонецФункции

&НаСервере
Функция СформироватьЦенникАттика()

	Возврат  Обработки.ТК_ПечатьЭтикетокИЦенников.СформироватьЦенникАттика(Объект.Товары);
КонецФункции

&НаСервере
Функция СформироватьЦенникДемента()

	Возврат  Обработки.ТК_ПечатьЭтикетокИЦенников.СформироватьЦенникДемента(Объект.Товары);
КонецФункции


&НаСервере
Функция СформироватьЦенник35х30()

	Возврат  Обработки.ТК_ПечатьЭтикетокИЦенников.СформироватьЦенник35х30(Объект.Товары);
КонецФункции

&НаСервере
Функция СформироватьЦенник40х30()

	Возврат  Обработки.ТК_ПечатьЭтикетокИЦенников.СформироватьЦенник40х30(Объект.Товары);
КонецФункции

&НаСервере
Функция СформироватьЦенник25х46()

	Возврат  Обработки.ТК_ПечатьЭтикетокИЦенников.СформироватьЦенник25х46(Объект.Товары);
КонецФункции

&НаСервере
Функция СформироватьЦенник60х38QRБаффет()
		Возврат  Обработки.ТК_ПечатьЭтикетокИЦенников.СформироватьЦенник60х38QRБаффет(Объект.Товары);
КонецФункции

&НаСервере
Функция СформироватьЦенник50х38QR()
		Возврат  Обработки.ТК_ПечатьЭтикетокИЦенников.СформироватьЦенник50х38QR(Объект.Товары);
КонецФункции

&НаКлиенте
Процедура ЗагрузитьИзТекстовогоПоля(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузитьИзТекстовогоПоляПродолжение", ЭтаФорма, Неопределено);
	
	ПоказатьВводСтроки(
		ОписаниеОповещения, 
		"", 
		НСтр("ru = 'Введите артикула товаров с новой строки или через запятую'; uk = 'Введіть артикули товарів з нової строки або через кому'"),
		0,
		Истина);
		
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзТекстовогоПоляПродолжение(Текст, ДопПараметры) Экспорт 
	
	Если Не ЗначениеЗаполнено(Текст) Тогда 
		Возврат;
	КонецЕсли;

	ЗагрузитьИзТекстовогоПоляНаСервере(Текст);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьИзТекстовогоПоляНаСервере(Текст)
	
	НовТекст = СтроковыеФункцииКлиентСервер.ЗаменитьОдниСимволыДругими(",.-;", Текст, Символы.ПС);	
	МассивСтрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивСлов(НовТекст, Символы.ПС);
	СписокНоменклатуры = Новый СписокЗначений;
	
	Для Каждого Стр Из МассивСтрок Цикл 
		текСтр = СокрЛП(Стр);
		
		Если ПустаяСтрока(текСтр) Тогда 
			Продолжить;
		ИначеЕсли Не СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(текСтр) Тогда 
			ОбщегоНазначения.СообщитьПользователю(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Неверный формат артикула ""%1""'; uk = 'Невірний формат артикулу ""%1""'"),
					текСтр));
		Иначе
			Номенклатура = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", текСтр);	
			Если Не Номенклатура.Пустая() Тогда 
				НоваяСтрока = СписокНоменклатуры.Добавить(Номенклатура);
			Иначе
				ОбщегоНазначения.СообщитьПользователю(
					СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'Не найдена номенклатура с артикулом ""%1""'; uk = 'Не знайдена номенклатура з артикулом ""%1""'"),
						текСтр));					
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	УстановитьОтборСКД("ОтборНоменклатура", ВидСравненияКомпоновкиДанных.ВСписке, СписокНоменклатуры);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборСКД(ИмяПоля, ВидОтбора, Значение)
	
	ПолеОтбора = Новый ПолеКомпоновкиДанных(ИмяПоля);
	ОтборыКомпановщика = КомпоновщикНастроек.Настройки.Отбор.Элементы;
	Для Каждого Стр Из ОтборыКомпановщика Цикл
		Если Стр.ЛевоеЗначение = ПолеОтбора Тогда
			Отбор = Стр;
		КонецЕсли;
	КонецЦикла;
	Если Отбор = Неопределено Тогда
		Отбор = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Отбор.ЛевоеЗначение  = ПолеОтбора;
	КонецЕсли;
	
	Если Значение <> Неопределено Тогда
		Отбор.ВидСравнения   = ВидОтбора;
		Отбор.Использование  = Истина;
		Отбор.ПравоеЗначение  = Значение;
	Иначе
		Отбор.Использование  = Ложь;
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти


#Область ПрочиеПроцедурыИФункции


#КонецОбласти
